БухЭксп/Catalogs/CW_ВебШаблоныЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебШаблоныЗаявок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеМакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМакетаНовойЗаявки</Name>
					<Comment>0 - стандартный; 1 - индивидуальный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокНовойЗаявкиRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокНовойЗаявкиEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокПоляRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокПоляEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодсказкаПоляRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодсказкаПоляEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрЗаявки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХраниилщеОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграничиватьДоступныеЗначеия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСсылка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбластиМакета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательноДляЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеТипаЗначения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяГруппыRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяГруппыEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеШрифт</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЦветФона</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЦветТекста</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьОформление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьЗаголовок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебШаблоныЗаявок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//События формы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьПараметрыОформленияПоУмолчанию();
	ОбработатьДоступностьВводаНаРазныхЯзыках();
	ЗаполнитьОписаниеДоступныхРеквизитов();  
	ТипМакетаНовойЗаявкиПриИзмененииНаСервере();
	РазрешеноПрикреплятьФайлыПриИзмененииНаСервере();
	
КонецПроцедуры     

&наСервере
Процедура ОбработатьДоступностьВводаНаРазныхЯзыках()
	
	Элементы.СоставЗаявкиПодсказкаПоляRU.КнопкаВыбора 	= Объект.ДоступенВыводНаАнглийскомЯзыке;
	Элементы.СоставЗаявкиЗаголовокПоляRU.КнопкаВыбора 	= Объект.ДоступенВыводНаАнглийскомЯзыке;
	Элементы.ГруппыПараметровИмяГруппыRU.КнопкаВыбора 	= Объект.ДоступенВыводНаАнглийскомЯзыке;
	Элементы.ПредставлениеRU.КнопкаВыбора 				= Объект.ДоступенВыводНаАнглийскомЯзыке;
	Элементы.ЗаголовокНовойЗаявкиRU.КнопкаВыбора 		= Объект.ДоступенВыводНаАнглийскомЯзыке;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьЗначенияДополительныхКолонок(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ДоступенВыводНаАнглийскомЯзыкеПриИзменении(Элемент)
	ОбработатьДоступностьВводаНаРазныхЯзыках();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ДобавитьГруппуСПустымИдентификатором(); 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Для Каждого СтрокаТаблицы из ТекущийОбъект.СоставЗаявки Цикл  
		ИндексСтроки	= ТекущийОбъект.СоставЗаявки.Индекс(СтрокаТаблицы);
		
		СтрокаОбъекта 	= Объект.СоставЗаявки[ИндексСтроки];  
		
		НастройкиОтбора	 = ПолучитьИзВременногоХранилища(СтрокаОбъекта.АдресОтбора);
		СтрокаТаблицы.ХраниилщеОтбора = Новый ХранилищеЗначения(НастройкиОтбора);
		
		ЗначениеПоУмолчанию = ПолучитьИзВременногоХранилища(СтрокаОбъекта.АдресЗначенияПоУмолчанию);
		СтрокаТаблицы.ЗначениеПоУмолчанию = Новый ХранилищеЗначения(ЗначениеПоУмолчанию);  
		
		СтрокаТаблицы.ХранилищеТипаЗначения = Новый ХранилищеЗначения(СтрокаОбъекта.ОписаниеТипа);  
	КонецЦикла;  
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект.ГруппыПараметров Цикл  
		ИндексСтроки	= ТекущийОбъект.ГруппыПараметров.Индекс(СтрокаТаблицы);
		
		СтрокаОбъекта 	= Объект.ГруппыПараметров[ИндексСтроки];  
		
		СтрокаТаблицы.ХранилищеШрифт 		= Новый ХранилищеЗначения(СтрокаОбъекта.Шрифт);
		СтрокаТаблицы.ХранилищеЦветФона 	= Новый ХранилищеЗначения(СтрокаОбъекта.ЦветФона);
		СтрокаТаблицы.ХранилищеЦветТекста 	= Новый ХранилищеЗначения(СтрокаОбъекта.ЦветТекста);   
		
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьЗначенияДополительныхКолонок(ТекущийОбъект);
КонецПроцедуры
//События формы

 
 //Состав заявик
&НаКлиенте    
Процедура СоставЗаявкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.ГиперссылкаЯчейки Тогда  

		СтандартнаяОбработка = Ложь;     
		
		ТекущиеДанные = Элементы.СоставЗаявки.ТекущиеДанные;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УстанвоитьПредставлениеЗначенияПоУмолчанию", ЭтотОбъект, ДополнительныеПараметры);
		
		Если Поле.Имя = "СоставЗаявкиАдресОтбора" Тогда  
			
			ПустаяСсылка = ТекущиеДанные.ОписаниеТипа.ПривестиЗначение(Неопределено);
			АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
			ПоместитьСхемуКомпановкиДанныхДляТипаПоАдресу(ТипЗнч(ПустаяСсылка), АдресСхемыКомпоновки);
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("АдресНастроек",	ТекущиеДанные.АдресОтбора);  
  			СтруктураПараметров.Вставить("СхемаКомпоновки",	АдресСхемыКомпоновки);  

			ОткрытьФорму("Справочник.CW_ВебШаблоныЗаявок.Форма.НастройкаОтбора", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
		ИначеЕсли Поле.Имя = "СоставЗаявкиПредставлениеЗначенияПоУмолчанию" Тогда 
			
			СтруктураПараметров = Новый Структура;     
			СтруктураПараметров.Вставить("ЗаголвоокПоля", 				ТекущиеДанные.ЗаголовокПоляRU);
			СтруктураПараметров.Вставить("АдресЗначенияПоУмолчанию",	ТекущиеДанные.АдресЗначенияПоУмолчанию);  
			СтруктураПараметров.Вставить("ОписаниеТипов", 				ТекущиеДанные.ОписаниеТипа);      

			ОткрытьФорму("Справочник.CW_ВебШаблоныЗаявок.Форма.ФормаУстановкиЗначенияПоУмолчанию", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура ПоместитьСхемуКомпановкиДанныхДляТипаПоАдресу(Тип, АдресРезультата)
	
	Справочники.CW_ВебШаблоныЗаявок.ПоместитьСхемуКомпановкиДанныхДляТипаПоАдресу(Тип, АдресРезультата);
		
КонецПроцедуры

&НаКлиенте
Процедура УстанвоитьПредставлениеЗначенияПоУмолчанию(Результат, ДополнительныеПараметры) Экспорт   
	
	Если Результат = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	УстанвоитьПредставлениеЗначенияПоУмолчаниюНаСервере(ДополнительныеПараметры);
	
КонецПроцедуры   

&НаСервере
Процедура УстанвоитьПредставлениеЗначенияПоУмолчаниюНаСервере(ДополнительныеПараметры)
	
	СтрокаТекущая 		= Объект.СоставЗаявки.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока); 
	ЗначениеПоУмолчанию = ПолучитьИзВременногоХранилища(СтрокаТекущая.АдресЗначенияПоУмолчанию);
	СтрокаТекущая.ПредставлениеЗначенияПоУмолчанию = Строка(ЗначениеПоУмолчанию);
	
	Модифицированность = Истина; 
	
КонецПроцедуры



&НаКлиенте
Процедура СоставЗаявкиЗаголовокПоляRUНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ТекущиеДанные 	= Элементы.СоставЗаявки.ТекущиеДанные;  
	ТекущаяСтрока 	= Элементы.СоставЗаявки.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ЗаголовокПоля");
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", ТекущиеДанные.ЗаголовокПоляRU);
	СтруктураПараметров.Вставить("EN", ТекущиеДанные.ЗаголовокПоляEN); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводРазноязычныхТекстов", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках",СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры


&НаКлиенте
Процедура СоставЗаявкиПодсказкаПоляRUНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)   

	СтандартнаяОбработка = ложь;

	ТекущиеДанные = Элементы.СоставЗаявки.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СоставЗаявки.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ПодсказкаПоля"); 
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", ТекущиеДанные.ПодсказкаПоляRU);
	СтруктураПараметров.Вставить("EN", ТекущиеДанные.ПодсказкаПоляEN); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводРазноязычныхТекстов", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках",СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры   

&НаКлиенте
Процедура СоставЗаявкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
	
	Отказ = истина;  

КонецПроцедуры   

&НаСервере
Функция ПолучитьИмяОбластиМакета()
	
	Если Объект.ТипМакетаНовойЗаявки = 1 Тогда
		Возврат "";
	КонецЕсли;
	
	ВремТаблица = Объект.СоставЗаявки.Выгрузить(,"НомерСтроки,ИмяОбластиМакета");
	ВремТаблица.Сортировать("ИмяОбластиМакета УБЫВ");	 
	
	ПерваяСтрока = ВремТаблица[0];
	Если ПустаяСтрока(ПерваяСтрока.ИмяОбластиМакета) Тогда 
		НомерОбласти = 1;
	Иначе
		НомерОбласти = Число(Сред(ПерваяСтрока.ИмяОбластиМакета, 2))+1;
	КонецЕсли; 
	
	Возврат "П" + Формат(НомерОбласти, "ЧЦ=9; ЧВН=; ЧГ=0");
	
КонецФункции

//Состав заявик


//Выбор типа "реквизит" 
&НаКлиенте
Процедура ДобавитьРеквизит(Команда)

	СписокДоступныхРеквизитов = ПолучитьСписокДоступныхРеквизитов();
	
	ОповещениеПриВыборе = Новый ОписаниеОповещения("ЗавершитьВыборРеквизита", ЭтотОбъект); 
	
	СписокДоступныхРеквизитов.ПоказатьВыборЭлемента(ОповещениеПриВыборе, "Выберие реквизит заявки");

КонецПроцедуры

&наКлиенте
Функция ПолучитьСписокДоступныхРеквизитов() 
	
	СписокДоступныхРеквизитов = Новый СписокЗначений;
	
	Для Каждого СтрокаОписания из ОписаниеРеквизитов Цикл
		СписокДоступныхРеквизитов.Добавить(СтрокаОписания.Имя, СтрокаОписания.Заголовок);	
	КонецЦикла;
	
	Возврат СписокДоступныхРеквизитов;

КонецФункции  

&НаКлиенте
Процедура ЗавершитьВыборРеквизита(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПараметрЗаявки", РезультатВыбора.Значение);  
	
	мСтроки = Объект.СоставЗаявки.НайтиСтроки(Отбор);
	Если мСтроки.Количество() > 0 Тогда
		ПоказатьПредупреждение(,"Реквизит "+СокрЛП(РезультатВыбора)+" уже есть в списке!");
		Возврат;
	КонецЕсли;
	
	ПродолжитьДобавлениеРеквизита(РезультатВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьДобавлениеРеквизита(Знач РезультатВыбора)
	
	ИдентификаторГруппы = ПустойУникальныйИдентификатор();
	
	СтрокаГруппы = Элементы.ГруппыПараметров.ТекущиеДанные;  
	Если СтрокаГруппы <> Неопределено Тогда
		ИдентификаторГруппы = СтрокаГруппы.ИдентификаторГруппы;	
	КонецЕсли;  
	
	ОписаниеРеквизита = ПолучитьОписаниеРеквизита(РезультатВыбора.Значение);   
	Если ОписаниеРеквизита = Неопределено Тогда
		ВызватьИсключение "Недоступное имя реквизита!";
	КонецЕсли;

	СтрокаТекущая =	Объект.СоставЗаявки.Добавить();
	СтрокаТекущая.ПараметрЗаявки	= РезультатВыбора.Значение;
	СтрокаТекущая.ИмяПоля			= "СоставЗаявки"+СокрЛП(ОписаниеРеквизита.Имя);
	СтрокаТекущая.ЗаголовокПоляRU	= СокрЛП(ОписаниеРеквизита.Заголовок);
	СтрокаТекущая.ПолеСсылка 		= ЭтоСсылка(ОписаниеРеквизита.ОписаниеТипов);
	СтрокаТекущая.ИндексКартинки	= 1;
	СтрокаТекущая.АдресОтбора 		= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	СтрокаТекущая.АдресЗначенияПоУмолчанию 	= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	СтрокаТекущая.ИдентификаторГруппы 		= ИдентификаторГруппы;
	СтрокаТекущая.ИмяОбластиМакета 			= ПолучитьИмяОбластиМакета(); 
	СтрокаТекущая.ОписаниеТипа 				= ОписаниеРеквизита.ОписаниеТипов; 
	
	ОбновитьКоличествоПолейГруппНаСервере();
	
	Модифицированность = истина;

КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеРеквизита(Знач РезультатВыбора)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Имя", РезультатВыбора);
	мСтроки = ОписаниеРеквизитов.НайтиСтроки(Отбор);
	Если мСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;                
	
	СтрокаОписания = мСтроки[0];
	
	ОписаниеРеквизита = Новый Структура;
	ОписаниеРеквизита.Вставить("Имя", 			СтрокаОписания.Имя);
	ОписаниеРеквизита.Вставить("Заголовок", 	СтрокаОписания.Заголовок);
	ОписаниеРеквизита.Вставить("ОписаниеТипов", СтрокаОписания.ОписаниеТипов);

	Возврат ОписаниеРеквизита;
	
КонецФункции   
//Выбор типа "реквизит"


//Выбор типа "параметр" 
&НаКлиенте
Процедура ДобавитьПараметр(Команда)
	
	//Удалено по заявке AFR-240232
	//СписокПараметров = ПолучитьСписокПараметров(); 
	//Если СписокПараметров = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;   
	//
	//СтруктураОтбора = Новый Структура;
	//СтруктураОтбора.Вставить("Ссылка", СписокПараметров);   
	//--Удалено по заявке AFR-240232
	
	СтруктураПараметров = Новый Структура;
	//Удалено по заявке AFR-240232
	//СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	//--Удалено по заявке AFR-240232
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	СтруктураПараметров.Вставить("ЗакрыватЬприВыборе", истина);

	ОповещениеПриВыборе = Новый ОписаниеОповещения("ЗавершитьВыборПараметра", ЭтотОбъект);  
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", СтруктураПараметров, ЭтаФорма,,,,ОповещениеПриВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПараметров()
	
	Если Не ЗначениеЗаполнено(Объект.ТипПеревозки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран тип перевозки", , "ТипПеревозки", "Объект");
		Возврат Неопределено;
	КонецЕсли;  
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыПеревозокПараметрыЗаявки.Параметр КАК Параметр
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок.ПараметрыЗаявки КАК CW_ТипыПеревозокПараметрыЗаявки
	               |ГДЕ
	               |	CW_ТипыПеревозокПараметрыЗаявки.Ссылка = &ТипПеревозки";
	
	Запрос.УстановитьПараметр("ТипПеревозки", Объект.ТипПеревозки);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();

	Возврат ТаблицаЗапроса.ВыгрузитьКолонку("Параметр");
	
КонецФункции

&наКлиенте
Процедура ЗавершитьВыборПараметра(ВыбранныйПараметр, ДополнительныеПараметры) ЭКспорт
	
	Если ВыбранныйПараметр = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПараметрЗаявки", ВыбранныйПараметр);  
	
	мСтроки = Объект.СоставЗаявки.НайтиСтроки(Отбор);
	Если мСтроки.Количество() > 0 Тогда
		ПоказатьПредупреждение(,"Парамтер "+СокрЛП(ВыбранныйПараметр)+" уже есть в списке!");
		Возврат;
	КонецЕсли;

	ПродолжитьВыборПараметра(ВыбранныйПараметр);
	
КонецПроцедуры

&наКлиенте
Процедура ПродолжитьВыборПараметра(Знач ВыбранныйПараметр)
	
	
	ИдентификаторГруппы = ПустойУникальныйИдентификатор();
	
	СтрокаГруппы = Элементы.ГруппыПараметров.ТекущиеДанные;  
	Если СтрокаГруппы <> Неопределено Тогда
		ИдентификаторГруппы = СтрокаГруппы.ИдентификаторГруппы;	
	КонецЕсли;
	
	ОписаниеПараметра = ПолучитьОписаниеПараметра(ВыбранныйПараметр);   
	
	СтрокаТекущая =	Объект.СоставЗаявки.Добавить();
	СтрокаТекущая.ПараметрЗаявки	= ВыбранныйПараметр;
	СтрокаТекущая.ИмяПоля			= "СоставЗаявки"+СокрЛП(ОписаниеПараметра.Имя);
	СтрокаТекущая.ЗаголовокПоляRU	= СокрЛП(ОписаниеПараметра.Заголовок);
	СтрокаТекущая.ПолеСсылка 		= ЭтоСсылка(ОписаниеПараметра.ОписаниеТипов);
	СтрокаТекущая.ИндексКартинки	= 2;    
	СтрокаТекущая.АдресОтбора 				= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	СтрокаТекущая.АдресЗначенияПоУмолчанию 	= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	СтрокаТекущая.ИдентификаторГруппы		= ИдентификаторГруппы;
	СтрокаТекущая.ИмяОбластиМакета 			= ПолучитьИмяОбластиМакета();
	СтрокаТекущая.ОписаниеТипа 				= ОписаниеПараметра.ОписаниеТипов; 
	
	ОбновитьКоличествоПолейГруппНаСервере();
	
	Модифицированность = истина;

КонецПроцедуры 
//Выбор типа "параметр"

//Редактирвоание многозычных текстов  
&НаКлиенте
Процедура ПредставлениеRUНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = ложь;
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", Объект.ПредставлениеRU);
	СтруктураПараметров.Вставить("EN", Объект.ПредставлениеEN); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводПредставленияНаразныхЯзыках", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗаврешитьВводПредставленияНаразныхЯзыках(РезультатВвода, ДополнительныеПараметры) Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаврешитьВводПредставленияНаразныхЯзыкахНаСервере(РезультатВвода);

	Модифицированность = истина;
	
КонецПроцедуры   

&НаСервере
Процедура ЗаврешитьВводПредставленияНаразныхЯзыкахНаСервере(РезультатВвода )
	
	Для Каждого КлючЗначение из РезультатВвода Цикл
		Объект["Представление"+КлючЗначение.Ключ] = КлючЗначение.Значение; 
	КонецЦикла;    
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаголовокНовойЗаявкиRUНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = ложь;
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", Объект.ЗаголовокНовойЗаявкиRU);
	СтруктураПараметров.Вставить("EN", Объект.ЗаголовокНовойЗаявкиEN);
	СтруктураПараметров.Вставить("МногострочныйРежим", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводЗаголовкаНаразныхЯзыках", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры

&НаКлиенте
Процедура ЗаврешитьВводЗаголовкаНаразныхЯзыках(РезультатВвода, ДополнительныеПараметры) Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаврешитьВводЗаголовкаНаразныхЯзыкахНаСервере(РезультатВвода);

	Модифицированность = истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаврешитьВводЗаголовкаНаразныхЯзыкахНаСервере(РезультатВвода )
	
	Для Каждого КлючЗначение из РезультатВвода Цикл
		Объект["ЗаголовокНовойЗаявки"+КлючЗначение.Ключ] = КлючЗначение.Значение; 
	КонецЦикла;    
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаврешитьВводРазноязычныхТекстов(РезультатВвода, ДополнительныеПараметры) Экспорт
	
	Если РезультатВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаврешитьВводРазноязычныхТекстовНаСервере(РезультатВвода, ДополнительныеПараметры);

	Модифицированность = истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаврешитьВводРазноязычныхТекстовНаСервере(РезультатВвода, ДополнительныеПараметры )
	
	СтрокаТекущая = Объект.СоставЗаявки.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);  
	Для Каждого КлючЗначение из РезультатВвода Цикл
		СтрокаТекущая[ДополнительныеПараметры.ИмяРеквизита+КлючЗначение.Ключ] = КлючЗначение.Значение; 
	КонецЦикла;    
	
КонецПроцедуры
//Редактирвоание многозычных текстов

//Работа с макетами
&НаСервере
Процедура ТипМакетаНовойЗаявкиПриИзмененииНаСервере()
	
	Элементы.ОткрытьКонстукторМакета.Видимость = (Объект.ТипМакетаНовойЗаявки = 1);  
	Элементы.ГруппаГруппыПараметров.Видимость  = (Объект.ТипМакетаНовойЗаявки = 0);   
	
КонецПроцедуры

&НаКлиенте
Процедура ТипМакетаНовойЗаявкиПриИзменении(Элемент)
	
	ЗаполнитьИменаЯчеекОбластиМакетаНаСервере();
	ТипМакетаНовойЗаявкиПриИзмененииНаСервере(); 
	
	Если Объект.ТипМакетаНовойЗаявки = 0 Тогда   
		ТекущиеДанные = Элементы.ГруппыПараметров.ТекущиеДанные;	
		ИдентификаторГруппы = ТекущиеДанные.ИдентификаторГруппы 
	КонецЕсли;
	
	УстановитьОтборСтрок(ИдентификаторГруппы);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьИменаЯчеекОбластиМакетаНаСервере()
	
	НомерОбласти = 1;
	Для Каждого СтрокаТаблицы из Объект.СоставЗаявки Цикл  
		Если Объект.ТипМакетаНовойЗаявки = 1 Тогда  
			СтрокаТаблицы.ИмяОбластиМакета = "";	
		Иначе
			СтрокаТаблицы.ИмяОбластиМакета = "П" + Формат(НомерОбласти,"ЧЦ=9; ЧВН=; ЧГ=0");  
			НомерОбласти = НомерОбласти + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//Работа с макетами  

&НаКлиенте
Процедура РазрешеноПрикреплятьФайлыПриИзменении(Элемент)
	РазрешеноПрикреплятьФайлыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазрешеноПрикреплятьФайлыПриИзмененииНаСервере()
	
	ЗапрашиватьТипФайла = ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	
	Если ЗапрашиватьТипФайла Тогда
		Элементы.ГруппаТипыПрикрепляемыхФайлов.Видимость = Объект.РазрешеноПрикреплятьФайлы;	
	КонецЕсли;
	
КонецПроцедуры



//Служебные
&наСервере
Процедура ЗаполнитьОписаниеДоступныхРеквизитов()
	
	мНедоступныеРеквизиты = Новый Массив;    
	мНедоступныеРеквизиты.Добавить("ВариантБюджета");
	мНедоступныеРеквизиты.Добавить("Архив");
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_Заявки.Реквизиты Цикл  
		Если мНедоступныеРеквизиты.Найти(Реквизит.Имя) = Неопределено Тогда
			НоваяСтрока = ОписаниеРеквизитов.Добавить();
			НоваяСтрока.Имя 			= Реквизит.Имя;
			НоваяСтрока.Заголовок       = Реквизит.Синоним;
			НоваяСтрока.ОписаниеТипов   = Реквизит.Тип;                        
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры   

&наСервере
Функция ЭтоСсылка(ОписаниеТипов)  
	
	Если ОписаниеТипов = Неопределено тогда
		Возврат ложь;
	КонецЕсли;
	
	ОписаниеТипаВсеСсылки = ОбщегоНазначения.ОписаниеТипаВсеСсылки(); 
	Возврат ОписаниеТипаВсеСсылки.СодержитТип(ОписаниеТипов.типы()[0]);
	
КонецФункции

&НаСервере
Функция ПолучитьОписаниеПараметра(ВыбранныйПараметр)
	
	ОписаниеПараметра = Новый Структура;
	ОписаниеПараметра.Вставить("Имя", 			ВыбранныйПараметр.Идентификатор);
	ОписаниеПараметра.Вставить("Заголовок", 	СокрЛП(ВыбранныйПараметр));
	ОписаниеПараметра.Вставить("ОписаниеТипов", ВыбранныйПараметр.ТипЗначения);
	
	Возврат ОписаниеПараметра;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияДополительныхКолонок(ТекущийОбъект)
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект.СоставЗаявки Цикл 
		ИндексСтроки 		= ТекущийОбъект.СоставЗаявки.Индекс(СтрокаТаблицы);  
		
		НастройкиОтбора 	= СтрокаТаблицы.ХраниилщеОтбора.Получить();   
		ОписаниеТипа 		= СтрокаТаблицы.ХранилищеТипаЗначения.Получить();   
		ЗначениеПоУмолчанию = СтрокаТаблицы.ЗначениеПоУмолчанию.Получить();   
		
		СтрокаОбъекта = Объект.СоставЗаявки[ИндексСтроки];  
		СтрокаОбъекта.АдресОтбора 						=  ПоместитьВоВременноеХранилище(НастройкиОтбора, Новый УникальныйИдентификатор);   
		СтрокаОбъекта.АдресЗначенияПоУмолчанию  		=  ПоместитьВоВременноеХранилище(ЗначениеПоУмолчанию, Новый УникальныйИдентификатор); 
		СтрокаОбъекта.ПредставлениеЗначенияПоУмолчанию  =  СокрЛП(ЗначениеПоУмолчанию);
		СтрокаОбъекта.ОписаниеТипа 						=  ОписаниеТипа; 
	КонецЦикла; 
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект.ГруппыПараметров Цикл   
		ИндексСтроки	= ТекущийОбъект.ГруппыПараметров.Индекс(СтрокаТаблицы);  
		СтрокаОбъекта 	= Объект.ГруппыПараметров[ИндексСтроки];  
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторГруппы", СтрокаОбъекта.ИдентификаторГруппы); 
		МассивПолей = Объект.ГруппыПараметров.НайтиСтроки(Отбор);
	
		СтрокаОбъекта.Шрифт 			= СтрокаТаблицы.ХранилищеШрифт.Получить();   
		СтрокаОбъекта.ЦветФона 			= СтрокаТаблицы.ХранилищеЦветФона.Получить();   
		СтрокаОбъекта.ЦветТекста 		= СтрокаТаблицы.ХранилищеЦветТекста.Получить();   
		СтрокаОбъекта.ИндексКартинки 	= ?(ЗначениеЗаполнено(СтрокаОбъекта.ИдентификаторГруппы), 0, 2);
		СтрокаОбъекта.КоличествоПолей 	=  МассивПолей.Количество();
		
	КонецЦикла; 
	
	ОбновитьКоличествоПолейГруппНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьКоличествоПолейГруппНаСервере()
	
	Для Каждого СтрокаГруппы из Объект.ГруппыПараметров Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторГруппы", СтрокаГруппы.ИдентификаторГруппы); 
		
		МассивПолей = Объект.СоставЗаявки.НайтиСтроки(Отбор);
		СтрокаГруппы.КоличествоПолей =  МассивПолей.Количество();
	КонецЦикла;
	
КонецПроцедуры

//Служебные    

&НаКлиенте
Процедура ГруппыПараметровПриАктивизацииСтроки(Элемент)
	
    ТекущиеДанные = Элементы.ГруппыПараметров.ТекущиеДанные;  
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСтрок(ТекущиеДанные.ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок(Знач ИдентификаторГруппы = Неопределено)
	
	ФиксированнаяСтруктура = Неопределено;
	Если ИдентификаторГруппы <> Неопределено Тогда
		ОтборСтрок = новый Структура;
		ОтборСтрок.Вставить("ИдентификаторГруппы", ИдентификаторГруппы);  
		ФиксированнаяСтруктура =     новый ФиксированнаяСтруктура(ОтборСтрок);
	Конецесли;
	
	Элементы.СоставЗаявки.ОтборСтрок = ФиксированнаяСтруктура;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПараметровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	ДобавитьГруппуСПустымИдентификатором();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппуСПустымИдентификатором()
	
	ПустойИдентификаторГруппы = ПустойУникальныйИдентификатор();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторГруппы", ПустойИдентификаторГруппы); 
	
	МассивСтрокСостава 	= Объект.СоставЗаявки.НайтиСтроки(Отбор);
	МассивСтрокГрупп 	= Объект.ГруппыПараметров.НайтиСтроки(Отбор);
	
	Если (МассивСтрокСостава.Количество() > 0 
		И МассивСтрокГрупп.Количество() = 0) 
		ИЛИ Объект.ГруппыПараметров.Количество() = 0 Тогда
		
		//Добавим группу с пустым идентификатором
		НоваяСтрока = Объект.ГруппыПараметров.Вставить(0);
		НоваяСтрока.ИмяГруппыRU 			= "<Пустая>"; 
		НоваяСтрока.ИдентификаторГруппы 	= ПустойИдентификаторГруппы;  
		НоваяСтрока.ИндексКартинки			= 2;
		НоваяСтрока.ЕстьОформление			= -1;
		
		ВыбранныеСтроки = Новый Массив;
		ВыбранныеСтроки.Добавить(НоваяСтрока.ПолучитьИдентификатор());
		
		УстановитьОформлениеПоУмолчаниюНаСервере(ВыбранныеСтроки);   
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПустойУникальныйИдентификатор()
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции

&НаКлиенте
Процедура ГруппыПараметровИмяГруппыRUНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ТекущиеДанные 	= Элементы.ГруппыПараметров.ТекущиеДанные;  
	ТекущаяСтрока 	= Элементы.ГруппыПараметров.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ИмяГруппы");
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("RU", ТекущиеДанные.ИмяГруппыRU);
	СтруктураПараметров.Вставить("EN", ТекущиеДанные.ИмяГруппыEN); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаврешитьВводРазноязычныхТекстов", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаТекстаНаРазныхЯзыках",СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры


&НаКлиенте
Процедура ГруппыПараметровПередУдалением(Элемент, Отказ)

	Отказ = истина;	
	
	ТекущиеДанные = Элементы.ГруппыПараметров.ТекущиеДанные; 
	Если ТекущиеДанные.ИндексКартинки = 2 Тогда
		ПоказатьПредупреждение(, "Нельзя удалять предопределенный элемент!");
		Возврат;
	КонецЕсли;   
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторГруппы", ТекущиеДанные.ИдентификаторГруппы); 
	
	ТекущаяСтрока = Элементы.ГруппыПараметров.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Отбор", Отбор); 
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока); 

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииГруппы", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Все поля, входящие в группу будут удалены. 
	                           |Продолжить?", Режим, 0);
	
КонецПроцедуры     

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдаленииГруппы(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	МассивСтрокСостава 	= Объект.СоставЗаявки.НайтиСтроки(ДополнительныеПараметры.Отбор);
	Для Каждого СтрокаМассива из МассивСтрокСостава Цикл   
		Объект.СоставЗаявки.Удалить(СтрокаМассива);
	КонецЦикла;  
	
	СтрокаТекущая = Объект.ГруппыПараметров.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	Объект.ГруппыПараметров.Удалить(СтрокаТекущая);
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппыПараметровПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) 
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ГруппыПараметров.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторГруппы = Новый УникальныйИдентификатор();
		ТекущиеДанные.КоличествоПолей	  = 0;
		
		ТекущаяСтрока = Элементы.ГруппыПараметров.ТекущаяСтрока;
		
		ВыбранныеСтроки = Новый Массив;
		ВыбранныеСтроки.Добавить(ТекущаяСтрока);
		
		УстановитьОформлениеПоУмолчаниюНаСервере(ВыбранныеСтроки);   
		
		УстановитьОтборСтрок(ТекущиеДанные.ИдентификаторГруппы);
	КонецЕсли;
	
КонецПроцедуры   


&НаКлиенте                            
Процедура ГруппыПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	Если Поле.ГиперссылкаЯчейки Тогда 
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.ГруппыПараметров.ТекущиеДанные;
		ТекущаяСтрока = Элементы.ГруппыПараметров.ТекущаяСтрока;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторГруппы) Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
        СтруктураПараметров.Вставить("Шрифт", 				ТекущиеДанные.Шрифт);
        СтруктураПараметров.Вставить("ЦветТекста", 			ТекущиеДанные.ЦветТекста);
        СтруктураПараметров.Вставить("ЦветФона", 			ТекущиеДанные.ЦветФона);
        СтруктураПараметров.Вставить("ОтображатьЗаголовок",	ТекущиеДанные.ОтображатьЗаголовок);
		
		ВыделенныеСтроки = Новый Массив;
		ВыделенныеСтроки.Добавить(ТекущаяСтрока);
		
		ОткрытьФормуНастройкиОформления(СтруктураПараметров, ВыделенныеСтроки);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыборОформления(РезультатОформления, ДополнительныеПараметры) Экспорт
	
	Если РезультатОформления = Неопределено Тогда
		Возврат;
	КонецЕсли;     
	
	СтрокаТекущая = Объект.ГруппыПараметров.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	СтрокаТекущая.Шрифт 		= РезультатОформления.Шрифт;
	СтрокаТекущая.ЦветТекста 	= РезультатОформления.ЦветТекста;
	СтрокаТекущая.ЦветФона 		= РезультатОформления.ЦветФона; 
	СтрокаТекущая.ЕстьОформление= 1;
	
КонецПроцедуры 

&НаКлиенте
Процедура ГруппыПараметровПриИзменении(Элемент)  
	
	ОбновитьКоличествоПолейГруппНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаявкиПриИзменении(Элемент) 
	
	ОбновитьКоличествоПолейГруппНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьПараметрВГруппу(Команда)
	
	
	ВыделенныеСтроки = Элементы.СоставЗаявки.ВыделенныеСтроки;  
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СписокГрупп = ПолучитьСписокГруппНаСервере();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьПеремещениеВгруппу", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокГрупп.ПоказатьВыборЭлемента(Оповещение, "Выберите группу");
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗавершитьПеремещениеВгруппу(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		СтрокаТекущая = Объект.СоставЗаявки.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтрокаТекущая.ИдентификаторГруппы = ЭлементСписка.Значение;                  
	КонецЦикла;   
	
	Модифицированность = истина;
	
	ОбновитьКоличествоПолейГруппНаСервере()
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокГруппНаСервере()
	
	СписокГрупп = Новый СписокЗначений;
	
	Для Каждого СтрокаГрупп из Объект.ГруппыПараметров Цикл
		СписокГрупп.Добавить(СтрокаГрупп.ИдентификаторГруппы, СтрокаГрупп.ИмяГруппыRU, , БиблиотекаКартинок.Папка);
	КонецЦикла; 
	
	Возврат СписокГрупп;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИмяОбластиМакета(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;      
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОбновленииИмениОбластиМакета", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Значение поля ""Имя области"" в строках будет обновлено. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОбновленииИмениОбластиМакета(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ЗаполнитьИменаЯчеекОбластиМакетаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ГруппыПараметровПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = ЛожЬ;
	
	СтрокаГруппы = Объект.ГруппыПараметров.НайтиПоИдентификатору(Строка); 
	
	Для Каждого СтрокаПоля из ПараметрыПеретаскивания.Значение Цикл
		СтрокаПоля.ИдентификаторГруппы = СтрокаГруппы.ИдентификаторГруппы;
	КонецЦикла;

КонецПроцедуры

//Оформление групп
&НаКлиенте
Процедура УстановитьОформление(Команда)
	
	ВыбранныеСтроки = Элементы.ГруппыПараметров.ВыделенныеСтроки;  
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;  
	
	СтруктураПараметров = Новый Структура(ОформлениеГруппПоУмолчанию);
	ОткрытьФормуНастройкиОформления(СтруктураПараметров, ВыбранныеСтроки);
	
КонецПроцедуры   

&НаКлиенте
Процедура ОткрытьФормуНастройкиОформления(СтруктураПараметров, ВыбранныеСтроки)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбранныеСтроки", ВыбранныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборОформленияГрупп", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаУстановкиОформления", СтруктураПараметров, ЭтаФорма,,,,Оповещение);

КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыборОформленияГрупп(РезультатОформления, ДополнительныеПараметры) Экспорт
	
	Если РезультатОформления = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ЗавершитьВыборОформленияГруппНаСервере(РезультатОформления, ДополнительныеПараметры);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыборОформленияГруппНаСервере(Знач РезультатОформления,  ДополнительныеПараметры)
	
	Для Каждого ТекущаяСтрока из ДополнительныеПараметры.ВыбранныеСтроки Цикл  
		УстановитьОформлениеСтрокиНаСервере(ТекущаяСтрока, РезультатОформления);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеСтрокиНаСервере(ТекущаяСтрока, Знач РезультатОформления)
	
	СтрокаТекущая = Объект.ГруппыПараметров.НайтиПоИдентификатору(ТекущаяСтрока);  
	Если Не ЗначениеЗаполнено(СтрокаТекущая.ИдентификаторГруппы) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТекущая.Шрифт 				= РезультатОформления.Шрифт;
	СтрокаТекущая.ЦветТекста 			= РезультатОформления.ЦветТекста;
	СтрокаТекущая.ЦветФона 				= РезультатОформления.ЦветФона; 
	СтрокаТекущая.ОтображатьЗаголовок	= РезультатОформления.ОтображатьЗаголовок; 
	СтрокаТекущая.ЕстьОформление		= 1;

КонецПроцедуры 


&НаКлиенте
Процедура УстановитьОформлениеПоУмолчанию(Команда)  
	
	ВыбранныеСтроки = Элементы.ГруппыПараметров.ВыделенныеСтроки;  
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	УстановитьОформлениеПоУмолчаниюНаСервере(ВыбранныеСтроки);

КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеПоУмолчаниюНаСервере(ВыбранныеСтроки)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбранныеСтроки", ВыбранныеСтроки);   
	
	РезультатОформления = Новый Структура(ОформлениеГруппПоУмолчанию);
	
	ЗавершитьВыборОформленияГруппНаСервере(РезультатОформления, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОформленияПоУмолчанию()
	
	ХранилищеЗначения 	= Константы.CW_ОформлениеГруппВебШаблонов.Получить();
	СтруктураПараметров = ХранилищеЗначения.Получить();
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Шрифт", 				ШрифтыСтиля.ШрифтТекста);
		СтруктураПараметров.Вставить("ЦветТекста", 			ЦветаСтиля.ЦветТекстаПоля);
		СтруктураПараметров.Вставить("ЦветФона", 			ЦветаСтиля.ЦветФонаПоля);
		СтруктураПараметров.Вставить("ОтображатьЗаголовок",	Истина);
	КонецЕсли;   
	
	ОформлениеГруппПоУмолчанию = Новый ФиксированнаяСтруктура(СтруктураПараметров);
	
КонецПроцедуры
//--Оформление групп
